In [14]:
import pandas as pd
df=pd.read_csv("employees.csv")
df=df.loc[[1,3,4],['Name','Salary']]
df

    Name  Salary
1    Bob   60000
3  David   70000
4    Eva   65000

In [18]:
#Salary > 55000 and Department != Finance.

#Print Name, Department, and Salary.
df=pd.read_csv("employees.csv")
df=df[(df['Salary']>5500) & (df['Department']!= 'Finance')]
df

   ID     Name  Salary Department
0   1    Alice   50000         HR
1   2      Bob   60000         IT
2   3  Charlie   55000         IT
4   5      Eva   65000         HR

In [22]:
df=pd.read_csv("employees.csv")
df=df['Department'].str.upper()
df

0         HR
1         IT
2         IT
3    FINANCE
4         HR
Name: Department, dtype: object

In [23]:
df=pd.read_csv("employees.csv")
df

   ID     Name  Salary Department
0   1    Alice   50000         HR
1   2      Bob   60000         IT
2   3  Charlie   55000         IT
3   4    David   70000    Finance
4   5      Eva   65000         HR

In [32]:
#Find all employees whose Name starts with ‘A’ or ‘E’.
df=pd.read_csv("employees.csv",usecols=['Name'])
df=df[(df['Name'].str.startswith('A')) | (df['Name'].str.startswith('E'))]
df

    Name
0  Alice
4    Eva

In [35]:
#Filter employees whose Department is in a list: ['IT', 'Finance'].
df=pd.read_csv("employees.csv")
df=df[df['Department'].isin(['IT', 'Finance'])]
df

   ID     Name  Salary Department
1   2      Bob   60000         IT
2   3  Charlie   55000         IT
3   4    David   70000    Finance

In [39]:
#Filter employees whose Salary is between 55000 and 70000.
df=pd.read_csv("employees.csv")
df=df[df['Salary'].between(55000,70000)]
df=df.reset_index(drop=True)
df

   ID     Name  Salary Department
1   2      Bob   60000         IT
2   3  Charlie   55000         IT
3   4    David   70000    Finance
4   5      Eva   65000         HR